GT1/turbulent_wedge/turbulent_wedge_kE/turbulent_wedge_kE_HRN_WF/turbulent_wedge_kE_HRN_WF_high_l/system/sampleDict0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

// Fields to sample.
fields
(
    U
    p
    wallShearStress
    //U.component(0) 
);

sets
(
    profile0						
    {						
	type	lineCell;					
	axis 	distance; //y;	

	start		(	7.996	0	0.1	);
	end		(	7.996	0.1	0.1	);	
    }							

);

// *********************************************************************** //
